fornewinstudy/STM32-microcontroller-experiment/06.定时器实验/App/LED/LED.c
/*********************************************************************************************************
* 模块名称：LED.c
* 摘    要：LED模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "LED.h"
#include "stm32f10x_conf.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  ConfigLEDGPIO(void);  //配置LED的GPIO

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigLEDGPIO
* 函数功能：配置LED的GPIO 
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static  void  ConfigLEDGPIO(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;  //GPIO_InitStructure用于存放GPIO的参数
                                                                     
  //使能RCC相关时钟
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE); //使能GPIOC的时钟
                                                                                                                 
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_4;           //设置引脚
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;     //设置I/O输出速度
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;     //设置模式
  GPIO_Init(GPIOC, &GPIO_InitStructure);                //根据参数初始化LED1的GPIO

//  GPIO_WriteBit(GPIOC, GPIO_Pin_4, Bit_SET);            //将LED1默认状态设置为点亮
 GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_RESET);  //将LED1默认状态设置为熄灭
  
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_5;           //设置引脚
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;     //设置I/O输出速度
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;     //设置模式
  GPIO_Init(GPIOC, &GPIO_InitStructure);                //根据参数初始化LED2的GPIO

  GPIO_WriteBit(GPIOC, GPIO_Pin_5, Bit_RESET);          //将LED2默认状态设置为熄灭
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitLED
* 函数功能：初始化LED模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void InitLED(void)
{
  ConfigLEDGPIO();  //配置LED的GPIO
}

/*********************************************************************************************************
* 函数名称：LEDFlickera
* 函数功能：LED闪烁函数(递增编码计数)
* 输入参数：cnt
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：LEDFlicker在Proc2msTask中调用，cnt为250时表示每500ms更改一次LED状态
*********************************************************************************************************/
void LEDFlickera(u16 cnt)
{
  static u16 s_iCnt;  //定义静态变量s_iCnt作为计数器
  
  s_iCnt++; //计数器的计数值加1
  
//  if(s_iCnt >= cnt)   //计数器的计数值大于cnt
//  { 
//    s_iCnt = 0;       //重置计数器的计数值为0

//    //LED1状态取反，实现LED0闪烁
//    GPIO_WriteBit(GPIOC, GPIO_Pin_4, (BitAction)(1 - GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_4)));
//    
//    //LED2状态取反，实现LED1闪烁
//    GPIO_WriteBit(GPIOC, GPIO_Pin_5, (BitAction)(1 - GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_5)));
//  }
  if(s_iCnt == cnt/4 )   //计数器的计数值
  {
   
    
   //LED2状态取反，实现LED2闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)));
 
    
  }
  
  if(s_iCnt == cnt/2 )   //计数器的计数值
  {
   
     //LED1状态取反，实现LED1闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_4)));
    
    //LED2状态取反，实现LED2闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)));
    
  }
  
  if(s_iCnt == (cnt/4)*3)   //计数器的计数值
  {
   

    //LED2状态取反，实现LED2闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)));
    
  }
  if(s_iCnt == cnt)
  {
    s_iCnt = 0;
    //LED1状态取反，实现LED1闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_4)));
    
    //LED2状态取反，实现LED2闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)));
    
  }
}

/*********************************************************************************************************
* 函数名称：LEDFlickerb
* 函数功能：LED闪烁函数(递减编码计数)
* 输入参数：cnt
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：LEDFlicker在Proc2msTask中调用，cnt为250时表示每500ms更改一次LED状态
*********************************************************************************************************/
void LEDFlickerb(u16 cnt)
{
  static u16 s_iCnt;  //定义静态变量s_iCnt作为计数器
  
  s_iCnt++; //计数器的计数值加1
  
//  if(s_iCnt >= cnt)   //计数器的计数值大于cnt
//  { 
//    s_iCnt = 0;       //重置计数器的计数值为0

//    //LED1状态取反，实现LED0闪烁
//    GPIO_WriteBit(GPIOC, GPIO_Pin_4, (BitAction)(1 - GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_4)));
//    
//    //LED2状态取反，实现LED1闪烁
//    GPIO_WriteBit(GPIOC, GPIO_Pin_5, (BitAction)(1 - GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_5)));
//  }
  if(s_iCnt == cnt/4 )   //计数器的计数值
  {
   
    //LED1状态取反，实现LED1闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_4)));
   //LED2状态取反，实现LED2闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)));
 
    
  }
  
  if(s_iCnt == cnt/2 )   //计数器的计数值
  {
   
    
    //LED2状态取反，实现LED2闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)));
    
  }
  
  if(s_iCnt == (cnt/4)*3)   //计数器的计数值
  {
   
    //LED1状态取反，实现LED1闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_4,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_4)));
    //LED2状态取反，实现LED2闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)));
    
  }
  if(s_iCnt == cnt)
  {
    s_iCnt = 0;
   
    
    //LED2状态取反，实现LED2闪烁
    GPIO_WriteBit(GPIOC,GPIO_Pin_5,(BitAction)(1-GPIO_ReadInputDataBit(GPIOC,GPIO_Pin_5)));
    
  }
}
